#include <iostream>
#include <string>
namespace cpp2 {
 /* --------------------------------------------------------------------- */
 /*
 mcxi
 mcxi 記法を解析するクラスです。
 */
 /* --------------------------------------------------------------------- */
 class mcxi {
 
 };
} // namespace cpp2
int main(){
 //char cに0～9までの値が入ってくるとすると、char cを整数に直すには？
 // '0'->0
 // '1'->1
 // '2'->2
 char c_9 ='9':
 int i_9=c_9-'0':
 std::cout<<i_9<<std::endl;
 //'0'->48
 '0'-'0'->'0'
 //'1'->49
  '1'-'0' =49--48=1;
 //'2'->50
 char c_0='0';
 
}
